In [5]:
%load_ext sql

In [7]:
%sql postgresql://postgres:yak152011@localhost/online_store

In [8]:
%%sql
CREATE TABLE Users (
  Id INTEGER PRIMARY KEY,
  First_Name TEXT,
  Last_Name TEXT,
  Email TEXT
);

INSERT INTO Users (Id, First_Name, Last_Name, Email)
VALUES
  (1, 'Kirill', 'Yakovlev', 'Yakovelv_Kirill@mail.ru'),
  (2, 'Ivan', 'Yakovlev', 'Iv_Yakovlev@mail.ru'),
  (3, 'Aleksey', 'Maltsev', 'maltsev@mail.ru'),
  (4, 'Dmitriy', 'Agafonov', 'dmit_ag@mail.ru');

 * postgresql://postgres:***@localhost/online_store
Done.
4 rows affected.

[]

In [9]:
%%sql
CREATE TABLE Products (
  Id INTEGER PRIMARY KEY,
  Name TEXT,
  Category_Id INTEGER,
  Price INTEGER
);

INSERT INTO Products (Id, Name, Category_Id, Price)
VALUES
  (1, 'iPhone', 1, 999),
  (2, 'Samsung Galaxy', 1, 899),
  (3, 'Pixel', 1, 799),
  (4, 'MacBook Pro', 2, 1999),
  (5, 'Surface Laptop', 2, 1499),
  (6, 'ThinkPad', 2, 1299),
  (7, 'Bose Headphones', 3, 299),
  (8, 'Sony Headphones', 3, 249),
  (9, 'Sennheiser Headphones', 3, 199);

 * postgresql://postgres:***@localhost/online_store
Done.
9 rows affected.

[]

In [10]:
%%sql
CREATE TABLE Categories (
  Id INTEGER PRIMARY KEY,
  Name TEXT
);

INSERT INTO Categories (Id, Name)
VALUES
  (1, 'Phones'),
  (2, 'Laptops'),
  (3, 'Headphones');

 * postgresql://postgres:***@localhost/online_store
Done.
3 rows affected.

[]

In [11]:
%%sql
CREATE TABLE Orders (
  Id INTEGER PRIMARY KEY,
  User_Id INTEGER,
  Product_Id INTEGER,
  Quantity INTEGER,
  Order_Date TEXT,
  FOREIGN KEY (User_Id) REFERENCES Users(Id),
  FOREIGN KEY (Product_Id) REFERENCES Products(Id)
);

INSERT INTO Orders (Id, User_Id, Product_Id, Quantity, Order_Date)
VALUES
  (1, 1, 1, 1, '2023-04-12'),
  (2, 1, 4, 1, '2023-04-12'),
  (3, 2, 2, 1, '2023-04-12'),
  (4, 3, 7, 2, '2023-04-11'),
  (5, 4, 6, 1, '2023-04-11'),
  (6, 4, 8, 1, '2023-04-11'),
  (7, 1, 3, 1, '2023-04-11'),
  (8, 2, 5, 1, '2023-04-10'),
  (9, 3, 9, 1, '2023-04-10');

 * postgresql://postgres:***@localhost/online_store
Done.
9 rows affected.

[]

# Задание
1. Получить информацию о кол-ве продаж всех товаров

In [12]:
%%sql
SELECT Products.Name, SUM(Orders.Quantity) AS Total_Quantity 
FROM Orders 
INNER JOIN Products ON Orders.Product_ID = Products.ID 
GROUP BY Products.ID;

 * postgresql://postgres:***@localhost/online_store
9 rows affected.

[('Samsung Galaxy', 1),
 ('Pixel', 1),
 ('Surface Laptop', 1),
 ('Sony Headphones', 1),
 ('MacBook Pro', 1),
 ('ThinkPad', 1),
 ('Sennheiser Headphones', 1),
 ('Bose Headphones', 2),
 ('iPhone', 1)]

2. Собрать статистику покупок пользователя (сколько и каких товаров купил конкретный пользователь)

In [13]:
%%sql
SELECT Users.First_Name, Users.Last_Name, Products.Name, Orders.Quantity
FROM Orders
INNER JOIN Users ON Orders.User_ID = Users.ID
INNER JOIN Products ON Orders.Product_ID = Products.ID
WHERE Users.ID = 1;

 * postgresql://postgres:***@localhost/online_store
3 rows affected.

[('Kirill', 'Yakovlev', 'iPhone', 1),
 ('Kirill', 'Yakovlev', 'MacBook Pro', 1),
 ('Kirill', 'Yakovlev', 'Pixel', 1)]

3. Отобразить историю продаж по дням (сколько товаров было продано в день)

In [14]:
%%sql
SELECT DATE(Orders.Order_Date) AS date, SUM(Orders.Quantity) AS total_number_sales
FROM Orders
GROUP BY date;

 * postgresql://postgres:***@localhost/online_store
3 rows affected.

[(datetime.date(2023, 4, 10), 2),
 (datetime.date(2023, 4, 12), 3),
 (datetime.date(2023, 4, 11), 5)]